In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [2]:
csv_file = "Resources/2018.csv"
happy_2018_df = pd.read_csv(csv_file)
happy_2018_df .head()

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
0,1,Finland,7.632,1.305,1.592,0.874,0.681,0.202,0.393
1,2,Norway,7.594,1.456,1.582,0.861,0.686,0.286,0.340
2,3,Denmark,7.555,1.351,1.590,0.868,0.683,0.284,0.408
3,4,Iceland,7.495,1.343,1.644,0.914,0.677,0.353,0.138
4,5,Switzerland,7.487,1.420,1.549,0.927,0.660,0.256,0.357

In [3]:
csv_file = "Resources/2019.csv"
happy_2019_df = pd.read_csv(csv_file)
happy_2019_df .head()

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298

### Create new data with select columns

In [4]:
new_happy_data_2018_df = happy_2018_df[['Overall rank', 'Country or region', 'Score']].copy()
new_happy_data_2018_df.head()

   Overall rank Country or region  Score
0             1           Finland  7.632
1             2            Norway  7.594
2             3           Denmark  7.555
3             4           Iceland  7.495
4             5       Switzerland  7.487

In [5]:
new_happy_data_2018_df["year_column"] = "2018"
new_happy_data_2018_df.head()

   Overall rank Country or region  Score year_column
0             1           Finland  7.632        2018
1             2            Norway  7.594        2018
2             3           Denmark  7.555        2018
3             4           Iceland  7.495        2018
4             5       Switzerland  7.487        2018

In [6]:
new_happy_data_2019_df = happy_2019_df[['Overall rank', 'Country or region', 'Score']].copy()
new_happy_data_2019_df.head()

   Overall rank Country or region  Score
0             1           Finland  7.769
1             2           Denmark  7.600
2             3            Norway  7.554
3             4           Iceland  7.494
4             5       Netherlands  7.488

In [7]:
new_happy_data_2019_df["year_column"] = "2019"
new_happy_data_2019_df.head()

   Overall rank Country or region  Score year_column
0             1           Finland  7.769        2019
1             2           Denmark  7.600        2019
2             3            Norway  7.554        2019
3             4           Iceland  7.494        2019
4             5       Netherlands  7.488        2019

### Merge Data and add "Year" column

In [8]:
final_data_merge_df = new_happy_data_2018_df.merge(new_happy_data_2019_df, on= 'Overall rank')
final_data_merge_df.head()

,Overall rank,Country or region_x,Score_x,year_column_x,Country or region_y,Score_y,year_column_y
0,1,Finland,7.632,2018,Finland,7.769,2019
1,2,Norway,7.594,2018,Denmark,7.600,2019
2,3,Denmark,7.555,2018,Norway,7.554,2019
3,4,Iceland,7.495,2018,Iceland,7.494,2019
4,5,Switzerland,7.487,2018,Netherlands,7.488,2019

### Connect to local database

In [9]:
rds_connection_string = "postgres:postgres@localhost:5432/happy_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [10]:
engine.table_names()

['year_2018', 'year_2019']

### Use pandas to load csv converted DataFrame into database

In [11]:
new_happy_data_2018_df.to_sql(name='year_2018', con=engine, if_exists='append', index=False)

### Use pandas to load csv converted DataFrame into database

In [12]:
new_happy_data_2019_df.to_sql(name='year_2019', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the year_2018 table
* NOTE: can also check using pgAdmin

In [13]:
pd.read_sql_query('select * from year_2018', con=engine).head()

   Overall rank Country or region  Score  year_column
0             1           Finland  7.632         2018
1             2            Norway  7.594         2018
2             3           Denmark  7.555         2018
3             4           Iceland  7.495         2018
4             5       Switzerland  7.487         2018

### Confirm data has been added by querying the year_2019 table

In [14]:
pd.read_sql_query('select * from year_2019', con=engine).head()

   Overall rank Country or region  Score  year_column
0             1           Finland  7.769         2019
1             2           Denmark  7.600         2019
2             3            Norway  7.554         2019
3             4           Iceland  7.494         2019
4             5       Netherlands  7.488         2019